geosmall/Arduino_Core_STM32/libraries/Wire/src/utility/twi.c
#if defined(I2C1_BASE)
/**
* @brief  This function handles I2C1 interrupt.
* @param  None
* @retval None
*/
void I2C1_EV_IRQHandler(void)
{
  I2C_HandleTypeDef *handle = i2c_handles[I2C1_INDEX];
  HAL_I2C_EV_IRQHandler(handle);
#if defined(STM32C0xx) || defined(STM32F0xx) || defined(STM32G0xx) || defined(STM32L0xx)
  HAL_I2C_ER_IRQHandler(handle);
#endif /* STM32C0xx || STM32F0xx || STM32G0xx || STM32L0xx */
}

#if !defined(STM32C0xx) && !defined(STM32F0xx) && !defined(STM32G0xx) && !defined(STM32L0xx)
/**
* @brief  This function handles I2C1 interrupt.
* @param  None
* @retval None
*/
void I2C1_ER_IRQHandler(void)
{
  I2C_HandleTypeDef *handle = i2c_handles[I2C1_INDEX];
  HAL_I2C_ER_IRQHandler(handle);
}
#endif /* !STM32C0xx && !STM32F0xx && !STM32G0xx && !STM32L0xx */
#endif // I2C1_BASE

#if defined(I2C2_BASE)
/**
* @brief  This function handles I2C2 interrupt.
* @param  None
* @retval None
*/
void I2C2_EV_IRQHandler(void)
{
#if defined(I2C3_BASE) && defined(STM32G0xx)
  /* I2C2_3_IRQHandler */
  I2C_HandleTypeDef *handle2 = i2c_handles[I2C2_INDEX];
  I2C_HandleTypeDef *handle3 = i2c_handles[I2C3_INDEX];
  if (handle2) {
    HAL_I2C_EV_IRQHandler(handle2);
    HAL_I2C_ER_IRQHandler(handle2);
  }
  if (handle3) {
    HAL_I2C_EV_IRQHandler(handle3);
    HAL_I2C_ER_IRQHandler(handle3);
  }
#else
  I2C_HandleTypeDef *handle = i2c_handles[I2C2_INDEX];
  HAL_I2C_EV_IRQHandler(handle);
#if defined(STM32F0xx) || defined(STM32G0xx) || defined(STM32L0xx)
  HAL_I2C_ER_IRQHandler(handle);
#endif /* STM32F0xx || STM32G0xx || STM32L0xx */
#endif
}

#if !defined(STM32F0xx) && !defined(STM32G0xx) && !defined(STM32L0xx)
/**
* @brief  This function handles I2C2 interrupt.
* @param  None
* @retval None
*/
void I2C2_ER_IRQHandler(void)
{
  I2C_HandleTypeDef *handle = i2c_handles[I2C2_INDEX];
  HAL_I2C_ER_IRQHandler(handle);
}
#endif /* !STM32F0xx && !STM32G0xx && !STM32L0xx */
#endif // I2C2_BASE

#if defined(I2C3_BASE) && !defined(STM32G0xx)
/**
* @brief  This function handles I2C3 interrupt.
* @param  None
* @retval None
*/
void I2C3_EV_IRQHandler(void)
{
  I2C_HandleTypeDef *handle = i2c_handles[I2C3_INDEX];
  HAL_I2C_EV_IRQHandler(handle);
#if defined(STM32L0xx)
  HAL_I2C_ER_IRQHandler(handle);
#endif /* STM32L0xx */
}

#if !defined(STM32L0xx)
/**
* @brief  This function handles I2C3 interrupt.
* @param  None
* @retval None
*/
void I2C3_ER_IRQHandler(void)
{
  I2C_HandleTypeDef *handle = i2c_handles[I2C3_INDEX];
  HAL_I2C_ER_IRQHandler(handle);
}
#endif /* !STM32L0xx */
#endif /* I2C3_BASE && ! STM32G0xx */

#if defined(I2C4_BASE)
/**
* @brief  This function handles I2C4 interrupt.
* @param  None
* @retval None
*/
void I2C4_EV_IRQHandler(void)
{
  I2C_HandleTypeDef *handle = i2c_handles[I2C4_INDEX];
  HAL_I2C_EV_IRQHandler(handle);
  HAL_I2C_ER_IRQHandler(handle);
}

/**
* @brief  This function handles I2C4 interrupt.
* @param  None
* @retval None
*/
void I2C4_ER_IRQHandler(void)
{
  I2C_HandleTypeDef *handle = i2c_handles[I2C4_INDEX];
  HAL_I2C_ER_IRQHandler(handle);
}
#endif // I2C4_BASE

#if defined(I2C5_BASE)
/**
* @brief  This function handles I2C5 interrupt.
* @param  None
* @retval None
*/
void I2C5_EV_IRQHandler(void)
{
  I2C_HandleTypeDef *handle = i2c_handles[I2C5_INDEX];
  HAL_I2C_EV_IRQHandler(handle);
}

/**
* @brief  This function handles I2C5 interrupt.
* @param  None
* @retval None
*/
void I2C5_ER_IRQHandler(void)
{
  I2C_HandleTypeDef *handle = i2c_handles[I2C5_INDEX];
  HAL_I2C_ER_IRQHandler(handle);
}
#endif // I2C5_BASE

#if defined(I2C6_BASE)
/**
* @brief  This function handles I2C6 interrupt.
* @param  None
* @retval None
*/
void I2C6_EV_IRQHandler(void)
{
  I2C_HandleTypeDef *handle = i2c_handles[I2C6_INDEX];
  HAL_I2C_EV_IRQHandler(handle);
}

/**
* @brief  This function handles I2C6 interrupt.
* @param  None
* @retval None
*/
void I2C6_ER_IRQHandler(void)
{
  I2C_HandleTypeDef *handle = i2c_handles[I2C6_INDEX];
  HAL_I2C_ER_IRQHandler(handle);
}
#endif // I2C6_BASE

/*******************************************************************************
 * DMA-based non-blocking I2C read functions
 * Phase 1: STM32F4xx support (no cache concerns)
 ******************************************************************************/
#if defined(HAL_DMA_MODULE_ENABLED)

/**
  * @brief  Get DMA stream and channel for I2C RX based on I2C instance
  * @param  obj : pointer to i2c_t structure
  * @param  dma_stream : pointer to store DMA stream
  * @param  dma_channel : pointer to store DMA channel (F4) or request (H7)
  * @param  dma_irqn : pointer to store DMA IRQ number
  * @retval 0 on success, -1 if I2C instance not supported for DMA
  */
static int i2c_get_dma_config(i2c_t *obj, DMA_Stream_TypeDef **dma_stream,
                               uint32_t *dma_channel, IRQn_Type *dma_irqn)
{
#if defined(STM32F4xx)
  /* F4xx DMA channel mapping for I2C RX:
   * I2C1 RX: DMA1 Stream 0, Channel 1
   * I2C2 RX: DMA1 Stream 2, Channel 7
   * I2C3 RX: DMA1 Stream 2, Channel 3
   */
#if defined(I2C1_BASE)
  if (obj->i2c == I2C1) {
    *dma_stream = DMA1_Stream0;
    *dma_channel = DMA_CHANNEL_1;
    *dma_irqn = DMA1_Stream0_IRQn;
    return 0;
  }
#endif
#if defined(I2C2_BASE)
  if (obj->i2c == I2C2) {
    *dma_stream = DMA1_Stream2;
    *dma_channel = DMA_CHANNEL_7;
    *dma_irqn = DMA1_Stream2_IRQn;
    return 0;
  }
#endif
#if defined(I2C3_BASE)
  if (obj->i2c == I2C3) {
    *dma_stream = DMA1_Stream2;
    *dma_channel = DMA_CHANNEL_3;
    *dma_irqn = DMA1_Stream2_IRQn;
    return 0;
  }
#endif
#elif defined(STM32H7xx)
  /* H7xx uses DMAMUX - channel is actually a request ID */
#if defined(I2C1_BASE)
  if (obj->i2c == I2C1) {
    *dma_stream = DMA1_Stream0;
    *dma_channel = DMA_REQUEST_I2C1_RX;
    *dma_irqn = DMA1_Stream0_IRQn;
    return 0;
  }
#endif
#if defined(I2C2_BASE)
  if (obj->i2c == I2C2) {
    *dma_stream = DMA1_Stream2;
    *dma_channel = DMA_REQUEST_I2C2_RX;
    *dma_irqn = DMA1_Stream2_IRQn;
    return 0;
  }
#endif
#if defined(I2C4_BASE)
  /* I2C4 on H7 uses BDMA, not supported in Phase 1 */
#endif
#endif /* STM32F4xx / STM32H7xx */

